# CircuitWorksetClosedWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..CircuitWorksetClosedWarning Property
BuiltInFailures..::..SystemsFailures Class See Also
---
The workset of the circuit is closed so the circuit path will not be displayed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircuitWorksetClosedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircuitWorksetClosedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircuitWorksetClosedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace